## 판다스 기초

    참고자료: https://dataitgirls2.github.io/10minutes2pandas/
    참고강의: 인프런(https://www.inflearn.com/course/%ED%8C%90%EB%8B%A4%EC%8A%A4-Pandas/lecture/19920)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame(
        {"a" : [4,5,6],
        "b" : [7,8,9],
        "c" : [10,11,12]},
        index=[1,2,3])# 이런 리스트 형태를 시리즈라 부르고 이것들의 집합을 DataFrame이라고 한다.

### 1. Pandas DataFrame &Series 이해하기

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [5]:
df[["a","b"]]

   a  b
1  4  7
2  5  8
3  6  9

In [6]:
df.loc[3]

a     6
b     9
c    12
Name: 3, dtype: int64

In [7]:
df.loc[1]

a     4
b     7
c    10
Name: 1, dtype: int64

In [8]:
df.loc[3,"a"]

6

In [10]:
df.iloc[2]

a     6
b     9
c    12
Name: 3, dtype: int64

In [11]:
df.iloc[:2]

   a  b   c
1  4  7  10
2  5  8  11

In [12]:
df.loc[:2]

   a  b   c
1  4  7  10
2  5  8  11

### 2. Pandas DataFrame 생성하고 Data 가져오기

In [9]:
df.loc[[1,2],["a","b"]]# 행과 열 순으로 지정해야된다.

   a  b
1  4  7
2  5  8

In [10]:
df2 = pd.DataFrame(
        [[4,5,6],
        [7,8,9],
        [10,11,12]],
        index=[1,2,3],
        columns=['a','b','c'])

df2

    a   b   c
1   4   5   6
2   7   8   9
3  10  11  12

In [11]:
df = pd.DataFrame(
        {"a" : [4,5,6],
        "b" : [7,8,9],
        "c" : [10,11,12]},
        index=[1,2,3])

df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

###### 이러한 형식으로도 DataFrame을 만들 수 있다.

###### 두개의 인덱스를 가지는 DataFrame 만들기

In [12]:
df3 = pd.DataFrame(
        {"a" : [4,5,6],
        "b" : [7,8,9],
        "c" : [10,11,12]},
        index=pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2)],
        names=['n','v']))
# 멀티 인덱스로 튜플로 지정해주었다.,
df3

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

### 3. Pandas DataFrame 비교연산자로 색인하기,drop_duplicates() (ROW)

###### 전체 Data에서 일부 행(row)의 값을 추출해서 나타내는 방법

In [13]:
df3[df3.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [14]:
df3[df3.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [15]:
df3[df3.b <= 7]

     a  b   c
n v
d 1  4  7  10

In [16]:
df3.b <= 7  # df3으로 묶은걸 풀면 불값으로 출력해준다.

n  v
d  1     True
   2    False
e  2    False
Name: b, dtype: bool

###### 대소문자를 구별해주어야한다.

In [17]:
df3.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [18]:
df4 = pd.DataFrame(
        {"a" : [4,5,6,6],
        "b" : [7,8,9,9],
        "c" : [10,11,12,12]},
        index=pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3)],
        names=['n','v']))

df4

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [19]:
df4.drop_duplicates()
# 중복값 처리 하는 방법이다.
# 이렇게 중복값을 처리한다음 새로운 변수값에 저장하여 활용할 수 있다.

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

### 4.Logic in Python (and pandas)-and,or,not,xor,any,all 연산 이해하기 (ROW)

In [20]:
df4["b"] != 7 # 7과 같지 않은것

n  v
d  1    False
   2     True
e  2     True
   3     True
Name: b, dtype: bool

In [21]:
df4[df4["b"] != 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12
  3  6  9  12

In [22]:
df4.a.isin(5)# isin 에는 list 형태로 값을 담아줘야하므로 오류 발생
#a라는 칼럼에 5라는 값이 있는지?? 확인

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [int]

In [23]:
df4.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
   3    False
Name: a, dtype: bool

In [24]:
df4[df4.a.isin([5])]  # 5라는 값이 있는 인덱스 값만을 출력해준다.

     a  b   c
n v
d 2  5  8  11

In [25]:
df4[df4["a"].isin([5])] # 칼럼 값이 특수문자나 한글로 되어 있을경우에는 이런식으로 해서 가지고온다.

     a  b   c
n v
d 2  5  8  11

In [26]:
df4["a"]  != 7

n  v
d  1    True
   2    True
e  2    True
   3    True
Name: a, dtype: bool

In [27]:
df4[df4["b"]  != 7] # bool값이 아닌 DataFrame 의 형태로 보고 싶으면 이런식으로

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12
  3  6  9  12

In [28]:
df4.a.isin(7)  # isin 에는 리스트 형식으로만! "list-like objects are allowed"

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [int]

In [29]:
df4.a.isin([5,6])

n  v
d  1    False
   2     True
e  2     True
   3     True
Name: a, dtype: bool

In [30]:
pd.isnull(df)

       a      b      c
1  False  False  False
2  False  False  False
3  False  False  False

In [31]:
import numpy as np
df5 = pd.DataFrame(
        {"a" : [4,5,6,6, np.nan],
        "b" : [7,8,np.nan,9,9],
        "c" : [10,np.nan,11,12,12]},
        index=pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',3)],
        names=['n','v']))

df5

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0   NaN
e 2  6.0  NaN  11.0
  3  6.0  9.0  12.0
  3  NaN  9.0  12.0

In [32]:
pd.isnull(df5) # 이렇게 널값을 찾을 수 있다.

         a      b      c
n v
d 1  False  False  False
  2  False  False   True
e 2  False   True  False
  3  False  False  False
  3   True  False  False

In [33]:
df5['a'].isnull().sum()

1

In [34]:
df5.a.isnull().sum()

1

In [35]:
pd.notnull(df5) # isnull 과 반대되는 의미

         a      b      c
n v
d 1   True   True   True
  2   True   True  False
e 2   True  False   True
  3   True   True   True
  3  False   True   True

In [36]:
df5.notnull().sum() # 이런식으로도 표현 가능하다.

a    4
b    4
c    4
dtype: int64

In [37]:
df5.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   3    False
Name: a, dtype: bool

In [38]:
df5[df5.a.notnull()]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0   NaN
e 2  6.0  NaN  11.0
  3  6.0  9.0  12.0

* &,|,~,^,df.any(),df.all()
* and, or, not, xor, any, all

###### and,or 등을 사용하고 싶으면 위에 걸로 바꿔서 사용해야지 판다스에서 읽힌다.

In [40]:
~df5.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   3     True
Name: a, dtype: bool

In [41]:
df5.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   3    False
Name: a, dtype: bool

###### 굳이 notnull과 isnull 을 구별해서 적는것 보다 ~ 나 등등 비교 연산자 같은걸 사용하면된다.

In [42]:
1 and 2

2

In [43]:
True and False # DataFrame 에서는 and를 사용할 수 없다.

False

In [47]:
df5[(df5['a'] == 5) | (df5['b'] == 7)]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0   NaN

### 5. head,tail로 데이터 미리보기 df.sapmple(frac=0.5),df.sample(n=10),df.nlargest,df.nsmallest (ROW)

In [48]:
df5

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0   NaN
e 2  6.0  NaN  11.0
  3  6.0  9.0  12.0
  3  NaN  9.0  12.0

In [49]:
df5.head(2)# 기본 값이 5이다

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0   NaN

###### 앞에서 2개의 row 값만 들고온것

In [50]:
df5.tail(2)

       a    b     c
n v
e 3  6.0  9.0  12.0
  3  NaN  9.0  12.0

######  뒤에서 2개의 row 값만 들고 온 것

In [51]:
df5.sample(frac=0.7)

       a    b     c
n v
e 3  NaN  9.0  12.0
  3  6.0  9.0  12.0
  2  6.0  NaN  11.0
d 1  4.0  7.0  10.0

###### 랜덤하게 샘플을 가지고 오는것  "frac=  " 는 샘플의 비율

In [52]:
df5.sample(n=2)

       a    b     c
n v
d 2  5.0  8.0   NaN
e 2  6.0  NaN  11.0

###### 특정 개수 만큼 랜덤하게 샘플을 가지고 오는 것

In [54]:
df5.iloc[1:2] # 인덱스는 0번부터 시작하므로 1번째 인덱스는 두번째 행이다.

       a    b   c
n v
d 2  5.0  8.0 NaN

######  Q. "앞에 값들과는 무관하게 몇번째 인덱스인지를 가지고온다" : iloc
###### 특정 인덱스를 가지고 오는것

In [ ]:
df5.nlargest?

###### 모르는 내용이 나오면 이렇게 ? 를 가지고 찾아볼 수 있다.

In [55]:
 df = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                   434000, 434000, 337000, 11300,
                                   11300, 11300],
                    'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                            17036, 182, 38, 311],
                    'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                                "IS", "NR", "TV", "AI"]},
                   index=["Italy", "France", "Malta",
                          "Maldives", "Brunei", "Iceland",
                          "Nauru", "Tuvalu", "Anguilla"])
 df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [56]:
 df.nlargest(3, 'population')

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT
Malta       434000    12011      MT

###### population 을 기준으로 가장 큰 값으로 3개의 인덱스를 출력

In [57]:
 df.nsmallest(3, 'population')

          population  GDP alpha-2
Nauru          11300  182      NR
Tuvalu         11300   38      TV
Anguilla       11300  311      AI

###### population 을 기준으로 가장 작은 값으로 3개의 인덱스를 출력

### 6. 일부 컬럼을 기준으로 데이터 가져오기 Subset Variables (COLUMNS)

In [70]:
import seaborn as sns #시각화 할 때 많이 쓰임

In [60]:
df6 = sns.load_dataset("iris")
df6.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [61]:
df6[['sepal_width','sepal_length','species']]

     sepal_width  sepal_length    species
0            3.5           5.1     setosa
1            3.0           4.9     setosa
2            3.2           4.7     setosa
3            3.1           4.6     setosa
4            3.6           5.0     setosa
..           ...           ...        ...
145          3.0           6.7  virginica
146          2.5           6.3  virginica
147          3.0           6.5  virginica
148          3.4           6.2  virginica
149          3.0           5.9  virginica

[150 rows x 3 columns]

In [62]:
columns = ['sepal_width','sepal_length','species']
df6[columns]

     sepal_width  sepal_length    species
0            3.5           5.1     setosa
1            3.0           4.9     setosa
2            3.2           4.7     setosa
3            3.1           4.6     setosa
4            3.6           5.0     setosa
..           ...           ...        ...
145          3.0           6.7  virginica
146          2.5           6.3  virginica
147          3.0           6.5  virginica
148          3.4           6.2  virginica
149          3.0           5.9  virginica

[150 rows x 3 columns]

###### 이런식으로 특정 컬럼을 지정하여 가지고 올 수 있다.

In [63]:
df6['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

###### df6['species']  or  df6.species 이런식으로 가져올 수 있는데, 후자의 경우에는 한글이나 특수문자등이 있을경우 error가 나타날 수 있으므로 앞에 처럼 감싸주는 형태로 표시하는것이 좋다.

In [64]:
df6.filter(regex='_')

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

###### filter : 특정 값이 들어가 있는 컬럼을 가지고온다.
###### 특정 값이 시작하는거나 끝나는 값을 가져올 수도있다.

In [65]:
df6.loc[:5,'sepal_width':'petal_width'] # 5까지 포함하여 행을 출력     즉, 해당인덱스 포함

   sepal_width  petal_length  petal_width
0          3.5           1.4          0.2
1          3.0           1.4          0.2
2          3.2           1.3          0.2
3          3.1           1.5          0.2
4          3.6           1.4          0.2
5          3.9           1.7          0.4

###### 0에서부터 5까지의 행을 가져오는데, 'SEPAL_WIDTH'~'petal_width'까지의 칼럼을 출력한다.

In [66]:
df6.iloc[:3,[1,2,4]] # 3은 제외한 앞까지 행을 출력, iloc와 loc의 차이     즉, 해당 인덱스 앞까지

   sepal_width  petal_length species
0          3.5           1.4  setosa
1          3.0           1.4  setosa
2          3.2           1.3  setosa

###### 0에서부터 2까지 행을 가져오는데, 칼럼중 1,2,4 에 해당되는 칼럼을 출력한다.

In [67]:
df6.loc[df6['sepal_length']> 7 ,['sepal_length','sepal_width']]

     sepal_length  sepal_width
102           7.1          3.0
105           7.6          3.0
107           7.3          2.9
109           7.2          3.6
117           7.7          3.8
118           7.7          2.6
122           7.7          2.8
125           7.2          3.2
129           7.2          3.0
130           7.4          2.8
131           7.9          3.8
135           7.7          3.0

###### 이러한 형식으로 표현이 가능하다.

### 7. 기본 통계 하기 value_counts, nunique,sum,count,mean,median

In [71]:
df6.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [72]:
df6['species'].value_counts()

versicolor    50
virginica     50
setosa        50
Name: species, dtype: int64

###### 어떤값이 얼마나 들어있는지 그룹별로 볼 수 있다.

In [73]:
df6['petal_width'].value_counts()

0.2    29
1.3    13
1.5    12
1.8    12
1.4     8
2.3     8
1.0     7
0.3     7
0.4     7
2.0     6
2.1     6
0.1     5
1.2     5
1.9     5
1.6     4
2.5     3
2.2     3
2.4     3
1.1     3
1.7     2
0.6     1
0.5     1
Name: petal_width, dtype: int64

In [74]:
pd.DataFrame(df6['species'].value_counts())

            species
versicolor       50
virginica        50
setosa           50

###### 이러한 식으로 데이터프레임을 씌워서 보일수도 있음!

In [75]:
len(df6)

150

###### 데이터프레임에 행이 얼마나 들어있는지 보여준다.

In [76]:
df6.shape

(150, 5)

###### 개인적으로 이게 더 편한듯 하니 알아만 두자 , 행이 얼마나 들어있는지만 볼려면 df6.shape[0] 이렇게도 표현 가능할꺼니

In [77]:
df6.shape[0]  #행의 갯수

150

In [78]:
df6['species'].nunique()

3

In [79]:
df6['sepal_length'].nunique()

35

###### nunique : 유니크한 값의 개수를 나타냄

In [80]:
df6.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [81]:
df6.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width     species
count     150.000000   150.000000    150.000000   150.000000         150
unique           NaN          NaN           NaN          NaN           3
top              NaN          NaN           NaN          NaN  versicolor
freq             NaN          NaN           NaN          NaN          50
mean        5.843333     3.057333      3.758000     1.199333         NaN
std         0.828066     0.435866      1.765298     0.762238         NaN
min         4.300000     2.000000      1.000000     0.100000         NaN
25%         5.100000     2.800000      1.600000     0.300000         NaN
50%         5.800000     3.000000      4.350000     1.300000         NaN
75%         6.400000     3.300000      5.100000     1.800000         NaN
max         7.900000     4.400000      6.900000     2.500000         NaN

###### describe : 데이터에 따른 간단한 통계치를 볼 수 있다. include ='all'을 사용하면 데이터 형식에 상관없이 값을 나타내준다.

In [82]:
df6.describe(include=[np.object]) # 문자(?) 변수 요약통계량값

           species
count          150
unique           3
top     versicolor
freq            50

###### 이런식으로 특정 데이터 타입의 값만을 찾아볼 수 도있다.

In [83]:
df6.describe(include=[np.number]) # 숫자형 변수 요약통계량값

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

```
sum()
Sum values of each object.
count()
Count non-NA/null values of
each object.
median()
Median value of each object.
quantile([0.25,0.75])
Quantiles of each object.
apply(function)
Apply function to each object.
min()
Minimum value in each object.
max()
Maximum value in each object.
mean()
Mean value of each object.
var()
Variance of each object.
std()
Standard deviation of ea
```

###### 이를통해 간단한 통계치를 출력할 수 있다.

In [85]:
df6['sepal_length'].sum()

876.5

In [87]:
df6.sum()

sepal_length                                                876.5
sepal_width                                                 458.6
petal_length                                                563.7
petal_width                                                 179.9
species         setosasetosasetosasetosasetosasetosasetosaseto...
dtype: object

In [91]:
df6.quantile([0.25, 0.75])

      sepal_length  sepal_width  petal_length  petal_width
0.25           5.1          2.8           1.6          0.3
0.75           6.4          3.3           5.1          1.8

In [93]:
df6['petal_width'].quantile([0.25, 0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

### 8. 판다스로 apply 활용하기 lambda 익명함수 사용하기
* apply(함수), 함수는 외부에서 만든 함수를 이용해도 되고, lambda를 이용해서 함수를 만들어도 됨

In [99]:
# 0번째 값을 호출하는 함수 적용
df6.apply(lambda x : x[0])

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [104]:
# 특정 변수에만 함수 적용, species변수에서 앞에 3글자만 뽑아오기
df6['species_3'] = df6['species'].apply(lambda x : x[:3])
df6

     sepal_length  sepal_width  petal_length  petal_width    species species_3
0             5.1          3.5           1.4          0.2     setosa       set
1             4.9          3.0           1.4          0.2     setosa       set
2             4.7          3.2           1.3          0.2     setosa       set
3             4.6          3.1           1.5          0.2     setosa       set
4             5.0          3.6           1.4          0.2     setosa       set
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       vir
146           6.3          2.5           5.0          1.9  virginica       vir
147           6.5          3.0           5.2          2.0  virginica       vir
148           6.2          3.4           5.4          2.3  virginica       vir
149           5.9          3.0           5.1          1.8  virginica       vir

[150 rows x 6 columns]

In [105]:
#외부에서 함수를 만들어 준 후 apply하기
#뒤에서 3번째 문자를 읽어오는 함수
def ftn(x) :
    species__3 = x[-3:]
    return species__3
df6['species__3'] = df6['species'].apply(ftn)
df6

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species__3
0,5.1,3.5,1.4,0.2,setosa,set,osa
1,4.9,3.0,1.4,0.2,setosa,set,osa
2,4.7,3.2,1.3,0.2,setosa,set,osa
3,4.6,3.1,1.5,0.2,setosa,set,osa
4,5.0,3.6,1.4,0.2,setosa,set,osa
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,ica
146,6.3,2.5,5.0,1.9,virginica,vir,ica
147,6.5,3.0,5.2,2.0,virginica,vir,ica
148,6.2,3.4,5.4,2.3,virginica,vir,ica
149,5.9,3.0,5.1,1.8,virginica,vir,ica

### 9.fillna,dropna로 결측치 다루기

### (1) fillna()로 결측치 채우기

In [2]:
# import pandas as pd
dict = {'FirstScore':[100, 90, np.nan, 95],
       'SecondScore':[30, 45, 56, np.nan],
       'ThirdScored':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df

   FirstScore  SecondScore  ThirdScored
0       100.0         30.0          NaN
1        90.0         45.0         40.0
2         NaN         56.0         80.0
3        95.0          NaN         98.0

#### 1-1) 특정 단일값으로 채우기

In [3]:
import numpy as np
df.fillna(0)

   FirstScore  SecondScore  ThirdScored
0       100.0         30.0          0.0
1        90.0         45.0         40.0
2         0.0         56.0         80.0
3        95.0          0.0         98.0

#### 1-2) 결측치 바로 이전의 값으로 채우기

In [116]:
df.fillna(method='pad') # 0행 3번째 열은 이전 값이 없으므로 NaN

   FirstScore  SecondScore  ThirdScored
0       100.0         30.0          NaN
1        90.0         45.0         40.0
2        90.0         56.0         80.0
3        95.0         56.0         98.0

#### 1-3) 결측치 바로 이후의 값으로 채우기

In [117]:
df.fillna(method='bfill')

   FirstScore  SecondScore  ThirdScored
0       100.0         30.0         40.0
1        90.0         45.0         40.0
2        95.0         56.0         80.0
3        95.0          NaN         98.0

### (2) dropna로 결측치 제거하기

#### 2-1) 열방향

In [4]:
df7 = pd.DataFrame([[np.nan, 2,np.nan, 0 ],[3,4,np.nan,1],
                  [np.nan,np.nan,np.nan,5]],columns=list('ABCD'))

In [5]:
df7

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [6]:
df7.dropna(axis=1,how='all') # axis = 1 : 열방향 이라는 뜻

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

###### how = 'all' : column 값들중 전부 nan값이 있는 열이면 drop을 시킨다는 의미이다.

In [119]:
df7.dropna(axis=1, how='any') # any : 열에 nan값이 하나라도 있으면 그 열을 drop 시킴

   D
0  0
1  1
2  5

#### 2-2) 행방향

In [122]:
df7.dropna(how='all') # axis = 1이 없으므로 행방향으로 drop시킴

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [123]:
values = {'A':0, 'B':1 ,'C': 2,'D':3 }
df7.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [134]:
d_mean = df7.mean()
pd.DataFrame(d_mean)

     0
A  3.0
B  3.0
C  NaN
D  2.0

In [135]:
df7.fillna(df7['D'].mean()) # 결측치를 D열의 평균으로 채운다.

     A    B    C  D
0  2.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  2.0  2.0  2.0  5

In [127]:
df7.isnull().sum()

A    2
B    1
C    3
D    0
dtype: int64

### 10.assign 으로 새로운 컬럼 만들기, qcut으로 binning, bucketing 하기

In [137]:
df8 = pd.DataFrame({'A':range(1,11),'B': np.random.randn(10)}) # np.random.randn(n) : 표준정규분포에서 n개의 수 랜덤 추출

df8

    A         B
0   1  0.222970
1   2 -1.593795
2   3 -1.607682
3   4  1.758571
4   5 -0.980861
5   6  0.517534
6   7  0.203356
7   8  1.178115
8   9 -2.122923
9  10 -1.388751

### 새로운 컬럼 만들기

In [138]:
df8.assign(ln_A = lambda x: np.log(x.A))

    A         B      ln_A
0   1  0.222970  0.000000
1   2 -1.593795  0.693147
2   3 -1.607682  1.098612
3   4  1.758571  1.386294
4   5 -0.980861  1.609438
5   6  0.517534  1.791759
6   7  0.203356  1.945910
7   8  1.178115  2.079442
8   9 -2.122923  2.197225
9  10 -1.388751  2.302585

###### assign 으로 새로운 컬럼을 추가할 수 있다.

In [139]:
df8["ln_A"] = np.log(df8.A)

df8

    A         B      ln_A
0   1  0.222970  0.000000
1   2 -1.593795  0.693147
2   3 -1.607682  1.098612
3   4  1.758571  1.386294
4   5 -0.980861  1.609438
5   6  0.517534  1.791759
6   7  0.203356  1.945910
7   8  1.178115  2.079442
8   9 -2.122923  2.197225
9  10 -1.388751  2.302585

###### 이러한 방법으로 추가 해도 된다.

### qcut : 숫자형 데이터들을 동일 개수로 나누어서 범주화 하기

In [144]:
pd.qcut(df8.B,3,labels=["good","medium","bad"]) # B열 데이터들을 3개의 범주로 동일 개수로 나누기

0    medium
1      good
2      good
3       bad
4    medium
5       bad
6    medium
7       bad
8      good
9      good
Name: B, dtype: category
Categories (3, object): ['good' < 'medium' < 'bad']

#### 순서는 'good' < 'medium' < 'bad'

In [143]:
pd.DataFrame(pd.qcut(df8.B,3,labels=["good","medium","bad"]))

        B
0  medium
1    good
2    good
3     bad
4  medium
5     bad
6  medium
7     bad
8    good
9    good

###### 3개의 구간으로 나눠 굿 미디엄 배드로 값을 측정하게 하였다.

In [145]:
df8.max(axis=0)

A       10.000000
B        1.758571
ln_A     2.302585
dtype: float64

In [147]:
df8.max(axis=1)

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

#### clip : clip(최소값 기준, 최대값 기준) 을 사용하면 
#### 최소값과 최대값 조건으로 값을 기준으로 해서, 이 범위 기준을 벗어나는 값에 대해서는 일괄적으로 최소값, 최대값으로 대치

In [148]:
df8["A"].clip(lower=-1,upper=3)

0    1
1    2
2    3
3    3
4    3
5    3
6    3
7    3
8    3
9    3
Name: A, dtype: int64

###### A의 원소 값들을 lower 의 값에서 upper의 값 사이에 오는 값으로 바꿔서 출력해준다.

In [149]:
df8["B"].abs()

0    0.222970
1    1.593795
2    1.607682
3    1.758571
4    0.980861
5    0.517534
6    0.203356
7    1.178115
8    2.122923
9    1.388751
Name: B, dtype: float64

###### abs()을 통해 절댓값들로 바꿔 출력하게 해준다.

### 11. df.sort_values, rename, sort_index, reset_index로 데이터 프레임 Reshaping 하기

In [153]:
df9= sns.load_dataset("mpg")
df9.shape ###### 데이터프레임에 행, 열이 얼마나 들어있는지 보여준다.

(398, 9)

In [151]:
df9.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

## sort_values : 정렬 (컬럼 값을 기준으로)

In [152]:
df9.sort_values('mpg').head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
28,9.0,8,304.0,193.0,4732,18.5,70,usa,hi 1200d
25,10.0,8,360.0,215.0,4615,14.0,70,usa,ford f250
26,10.0,8,307.0,200.0,4376,15.0,70,usa,chevy c20
103,11.0,8,400.0,150.0,4997,14.0,73,usa,chevrolet impala
124,11.0,8,350.0,180.0,3664,11.0,73,usa,oldsmobile omega

###### mpg라는 컬럼을 기준으로 작은값부터 오름차순으로 정렬한다.

In [154]:
df9.sort_values('mpg',ascending=False).head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
322,46.6,4,86.0,65.0,2110,17.9,80,japan,mazda glc
329,44.6,4,91.0,67.0,1850,13.8,80,japan,honda civic 1500 gl
325,44.3,4,90.0,48.0,2085,21.7,80,europe,vw rabbit c (diesel)
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
326,43.4,4,90.0,48.0,2335,23.7,80,europe,vw dasher (diesel)

###### asoending=False 를 통해 내림차순으로 정렬을 해준다.

 ###### axis, inplace 등등 을 통해 좀더 탄력적으로 처리가능하다.   sort_values? 를 통해 확인해보기

## rename : 컬럼 이름 변경하기
* df.rename(columns={키(기존컬럼명) : 벨류(바꾸려는 이름})

In [155]:
df9.rename(columns={"model_year": 'year'}).head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [156]:
df9.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

###### rename 을 통해 이름을 변경시켜준것을 따로 저장하지 않으면 다시 데이터프레임을 가지고 올떄는 이전 값으로 나오게 된다. 
###### 따라서, rename을 통해 변경한 데이터프레임의 값을 다른 변수에 저장을 해서 사용해야된다. 혹은 inplace = True인자를 넣는다.

In [160]:
df9.rename(columns={"model_year": 'year'}, inplace=True)
df9.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

## sort_index : 정렬 (인덱스를 기준으로)

In [162]:
df9.sort_index(ascending=False).head() ## 인덱스 번호를 기준으로 내림차순

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl

###### 인덱스를 기준으로 정렬을 하겠다는 의미

## reset_index : 컬럼명 인덱스가 아닌 행 번호 인덱스로 사용하고 싶은 경우

In [167]:
df = pd.DataFrame({'name': ['Alice','Bob','Charlie','Dave','Ellen','Frank'],
                   'age': [24,42,18,68,24,30],
                   'state': ['NY','CA','CA','TX','CA','NY'],
                   'point': [64,24,70,70,88,57]}
                  )

# 인덱스를 name로 지정(컬럼명으로 인덱스를 지정할 경우) : set_index
df.set_index('name', inplace=True)
df

         age state  point
name
Alice     24    NY     64
Bob       42    CA     24
Charlie   18    CA     70
Dave      68    TX     70
Ellen     24    CA     88
Frank     30    NY     57

In [166]:
# 컬럼명 인덱스 제거 후 행번호 인덱스 생성
df_r = df.reset_index()
df_r

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     24
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

###### reset_index() 는 인덱스가 없을떄 0부터 시작하는 인덱스를 새로 만들고 싶다. 할떄 쓰는것

## Drop : 행이나 열 제거

In [168]:
df10 = df9.rename(columns={"model_year": 'year'})

df10.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [171]:
df10.drop(columns=['mpg','year','name'])
df10.head()

   cylinders  displacement  horsepower  weight  acceleration origin
0          8         307.0       130.0    3504          12.0    usa
1          8         350.0       165.0    3693          11.5    usa
2          8         318.0       150.0    3436          11.0    usa
3          8         304.0       150.0    3433          12.0    usa
4          8         302.0       140.0    3449          10.5    usa

In [177]:
df10.drop(['cylinders'], axis = 1, inplace=True)
df10.head()

   displacement  horsepower  weight  acceleration
0         307.0       130.0    3504          12.0
1         350.0       165.0    3693          11.5
2         318.0       150.0    3436          11.0
3         304.0       150.0    3433          12.0
4         302.0       140.0    3449          10.5

###### drop 을 통해 수정한 데이터프레임을 따로 저장하지 않으면 다시 데이터프레임을 가지고 올떄는 이전 값으로 나오게 된다.
###### 따라서, drop을 통해 변경한 데이터프레임의 값을 다른 변수에 저장을 해서 사용해야된다. 
###### 혹은 inplace=True

In [170]:
df11 = df10.drop(columns=['mpg','year','name'])

df11.head()

   cylinders  displacement  horsepower  weight  acceleration origin
0          8         307.0       130.0    3504          12.0    usa
1          8         350.0       165.0    3693          11.5    usa
2          8         318.0       150.0    3436          11.0    usa
3          8         304.0       150.0    3433          12.0    usa
4          8         302.0       140.0    3449          10.5    usa

### 12. melt, pivot 으로 Tidy Data 만들기

#### 1) pd.melt(data, id_vars=[ ], value_vars = [ ])

In [3]:
import pandas as pd
df12 = pd.DataFrame({'A':{0:'a', 1: 'b', 2:'c'},
                    'B':{0:1,1:3,2:5},
                    'C': {0:2,1:4,2:6}})

df12

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [4]:
pd.melt(df12, id_vars = ['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

###### melt를 통해서 컬럼 값을 로우로 옴겨볼 수 있었다.

In [5]:
pd.melt(df12, value_vars=['A','B','C'])

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

In [7]:
# variable을 var로, value를 val로 이름 바꾸기
df13 = pd.melt(df12, value_vars=['A','B','C']).rename(columns={
    'variable': 'var',
    'value' : 'val'})

df13

  var val
0   A   a
1   A   b
2   A   c
3   B   1
4   B   3
5   B   5
6   C   2
7   C   4
8   C   6

###### 이러한 형식으로 rename 하여 적용할 수 있다.

#### df.pivot(index = , columns = , values = )

In [12]:
df14 = pd.DataFrame({'foo':['one','one','one','two','two','two'],
                    'bar':['A','B','C','A','B','C'],
                    'baz': [1,2,3,4,5,6]})

df14

   foo bar  baz
0  one   A    1
1  one   B    2
2  one   C    3
3  two   A    4
4  two   B    5
5  two   C    6

In [13]:
df14.pivot(index='foo',columns='bar',values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

###### 이런식으로 로우값을 칼럼값으로 변형 시켜줄 수 있다. index ,columns,values를 어찌 지정한지 잘봐두자.

In [14]:
df15 = df14.pivot(index='foo',columns='bar',values='baz').reset_index()

df15

bar  foo  A  B  C
0    one  1  2  3
1    two  4  5  6

###### 이런식으로 reset_index()를 통해 인덱스를 새로 만들어서 보기 편하게 바꿀수있다.

###### 수정한 데이터프레임을 따로 저장하지 않으면 다시 데이터프레임을 가지고 올떄는 이전 값으로 나오게 된다.
###### 따라서, 변경한 데이터프레임의 값을 다른 변수에 저장을 해서 사용해야된다.

In [17]:
df15.melt(id_vars=['foo'], value_vars=['A','B','C'])

   foo bar  value
0  one   A      1
1  two   A      4
2  one   B      2
3  two   B      5
4  one   C      3
5  two   C      6

In [18]:
df15.melt(id_vars=['foo'], value_vars=['A','B','C']).sort_values('foo')

   foo bar  value
0  one   A      1
2  one   B      2
4  one   C      3
1  two   A      4
3  two   B      5
5  two   C      6

In [20]:
df16 = df15.melt(id_vars=['foo'], value_vars=['A','B','C']).sort_values(['foo', 'bar']).rename(columns={'value': 'baz'})

df16

   foo bar  baz
0  one   A    1
2  one   B    2
4  one   C    3
1  two   A    4
3  two   B    5
5  two   C    6

###### 이런식으로 배웠던 내용들을 이용해서 데이터프레임을 조작하는걸 배웠다.

### 13.pd.concat([df1,df2]) 시리즈, 데이터프레임 합치기
* 행방향 : axis = 0, 열방향 : axis = 1

#### 1) 시리즈 합치기
* 열 이름 지정할 때 names 사용

In [21]:
pd.concat?

In [22]:
s1 = pd.Series(['a', 'b'])

s1

0    a
1    b
dtype: object

In [23]:
s2 = pd.Series(['c', 'd'])

s2

0    c
1    d
dtype: object

In [24]:
 pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

###### 이렇게 concat을 통해 데이터프레임을 합칠 수 있다.

In [25]:
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [26]:
pd.concat([s1, s2], keys = ['s1','s2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [27]:
pd.concat([s1, s2], keys = ['s1','s2'], names=['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

###### 이러한 식으로 조작이 가능하다.

#### 2) 데이터프레임 합치기
* 열 이름은 columns로 지정

In [28]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [29]:
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                    columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [30]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [31]:
 df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                    columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [32]:
# 형태가 다른 두 데이터프레임 합치기
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

* pd.concat()함수는 또한 default로 outer를 가진다.
#### 이어붙이는 방식을 outer는 합집합, inner는 교집합을 의미

In [33]:
pd.concat([df1, df3], join="inner") # join = 'inner'를 하면 animal은 없어짐

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

###### DB 시간떄 배운 join을 생각하자.

In [41]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                    columns=['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [39]:
pd.concat([df1, df4], axis=1) # axis = 1을 지정하면 열방향(왼쪽-> 오른쪽)으로 합쳐진다.

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [35]:
df5 = pd.DataFrame([1], index=['a'])
df5

   0
a  1

In [36]:
df6 = pd.DataFrame([2], index=['a'])
df6

   0
a  2

In [38]:
 pd.concat([df5, df6])

   0
a  1
a  2

In [37]:
 pd.concat([df5, df6], verify_integrity=True) # 중복된 값이 있는지 체크, 위에서 볼 수 있듯이 중복된 값이 있으므로 오류가 난다.

ValueError: Indexes have overlapping values: Index(['a'], dtype='object')

###### 중복된 값이 있는지 검증을 할 수 있는 옵션이다.

### 14. pd.merge로 데이터프레임 합치기 left, right, inner, outer 옵션 사용하기

* 각 데이터에 존재하는 고유값(key)을 기준으로 병합

* 아무 옵션을 적용하지 않으면, on=None이므로 두 데이터의 공통 열을 기준으로 
    how = 'inner'(교집합) 조인
    
* how = 'outer'(합집합)옵션을 줘서 공통 열을 기준으로 합치되, 어느한쪽에라도 없는 데이터가 있는 경우 NaN값이 지정

* how='left'옵션을 주면, 왼쪽 데이터의 고유값을 기준으로 합치고, 오른쪽 데이터에 없을 경우 NaN값 지정

* how='right'옵션을 주면, 오른쪽 데이터의 고유값을 기준으로 합치고, 왼쪽 데이터에 없을 경우 NaN값 지정

* 서로 다른 컬럼 이름을 가질 경우, 좌측 데이터프레임 이름을 left_on인수로,우측 데이터 프ㅔ레임의 이름을 right_on인수에 지정해서 합친다.

In [42]:
adf = pd.DataFrame({"x1":["A","B","C"],"x2":[1,2,3]})

adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [43]:
bdf = pd.DataFrame({"x1":["A","B","D"],"x3":["T","F","T"]})

bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [44]:
pd.merge(adf, bdf ,how ='left',on='x1') #왼쪽 데이터 x1을 기준으로 합치기

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [45]:
pd.merge(adf, bdf ,how ='right',on='x1') # 오른쪽 데이터 x1을 기준으로 합치기

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [46]:
pd.merge(adf, bdf ,how ='inner',on='x1') # 교집합

  x1  x2 x3
0  A   1  T
1  B   2  F

In [47]:
pd.merge(adf, bdf ,how ='outer',on='x1') # 합집합

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

###### 파이썬라이브러리를이용한 데이터분석 책 p250~  내용 참고

In [48]:
adf.x1.isin(bdf.x1) #adf의 x1컬럼에 bdf의 x1컬럼의 요소들이 있는지 비교

0     True
1     True
2    False
Name: x1, dtype: bool

In [49]:
adf[adf.x1.isin(bdf.x1)] #위 결과에서 True 행을 추출

  x1  x2
0  A   1
1  B   2

In [50]:
adf[~adf.x1.isin(bdf.x1)] #위 결과에서 False 행을 추출

  x1  x2
2  C   3

In [51]:
ydf = pd.DataFrame({"x1":["A","B","C"],"x2":[1,2,3]})

ydf

  x1  x2
0  A   1
1  B   2
2  C   3

In [52]:
zdf = pd.DataFrame({"x1":["B","C","D"],"x2":[5,3,4]})

zdf

  x1  x2
0  B   5
1  C   3
2  D   4

In [57]:
pd.merge(ydf,zdf) #공통 열(x1)을 기준으로 inner(교집합) 결합

  x1  x2
0  C   3

In [54]:
pd.merge(ydf,zdf, how='outer')

  x1  x2
0  A   1
1  B   2
2  C   3
3  B   5
4  D   4

In [55]:
pd.merge(ydf,zdf, how='outer',indicator=True)

  x1  x2      _merge
0  A   1   left_only
1  B   2   left_only
2  C   3        both
3  B   5  right_only
4  D   4  right_only

In [56]:
# query ('조건'): 조건에 맞는 데이터 추출 
# 위 표에서 _merge가 "left_only"인 행을 추출하는데 이때 _merge컬럼은 없애고 출력.
pd.merge(ydf,zdf, how='outer',indicator=True).query('_merge == "left_only"').drop(columns=['_merge'])

  x1  x2
0  A   1
1  B   2

###### 위에 내용 이해하고 넘어가기!

### 15. groupby 활용하여 다양한 데이터 집계를 활용하기

* 그룹 별로 나누고 (split), 각 그룹별로 집계함수를 적용(apply) 한후, 그룹별 집계 결과를 하나로 합치는(combine)

In [7]:
import seaborn as sns
df = sns.load_dataset("mpg")
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [9]:
df.groupby(by = "origin").size() #by 안써도 됨.

origin
europe     70
japan      79
usa       249
dtype: int64

In [11]:
df.groupby("origin").size()["europe"]

70

######  같은 카테고리의 데이터끼리 묶어서 그 그룹끼리의 연산을 하는것 (이것도 DB에서 배운 내용이랑 흡사)

In [63]:
# origin에 따른 cylinders의 평균 구하기
df.groupby(by="origin")['cylinders'].mean()

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [16]:
# 그룹을 여러개 지정도 가능
pd.DataFrame(df.groupby(['model_year','origin'])['cylinders'].mean())

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000
           usa      6.200000
72         europe   4.000000
           japan    3.800000
           usa      6.888889
73         europe   4.000000
           japan    4.250000
           usa      7.241379
74         europe   4.000000
           japan    4.000000
           usa      6.266667
75         europe   4.000000
           japan    4.000000
           usa      6.400000
76         europe   4.250000
           japan    4.500000
           usa      6.363636
77         europe   4.000000
           japan    4.166667
           usa      6.222222
78         europe   4.833333
           japan    4.000000
           usa      6.000000
79         europe   4.250000
           japan    4.000000
           usa      6.260870
80         europe   4.111111
           japan    4.076923
           usa      4.285714
81         europe   4.500000
           japan    4.333333
           usa      4.923077
82         europe   4.000000
           japan    4.000000
           usa      4.300000

In [65]:
df2 = pd.DataFrame(
[[4,7,10],
[5,8,11],
[6,9,12]],
index = [1,2,3],
columns=['a','b','c'])

df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [66]:
df2.shift(1)

     a    b     c
1  NaN  NaN   NaN
2  4.0  7.0  10.0
3  5.0  8.0  11.0

In [67]:
df2.shift(-1)

     a    b     c
1  5.0  8.0  11.0
2  6.0  9.0  12.0
3  NaN  NaN   NaN

###### row 값들이 하나씩 쉬프트가 된다.

In [69]:
df2['a'].shift(-1)

1    5.0
2    6.0
3    NaN
Name: a, dtype: float64

###### 특정 칼럼만 쉬프트 할 수 도 있다.

In [70]:
df["model_year"].rank(method='dense') # dense : 두명이 공동 1등이면 둘다 1등 처리

0       1.0
1       1.0
2       1.0
3       1.0
4       1.0
       ...
393    13.0
394    13.0
395    13.0
396    13.0
397    13.0
Name: model_year, Length: 398, dtype: float64

######  rank를 통해 순위를 나타낼 수 있다.

In [71]:
df["model_year"].rank(pct=True).head(10)

0    0.037688
1    0.037688
2    0.037688
3    0.037688
4    0.037688
5    0.037688
6    0.037688
7    0.037688
8    0.037688
9    0.037688
Name: model_year, dtype: float64

###### pct를 통해 비율을 나타낼 수도있다.

In [72]:
df2.cumsum() # 행방향(아래쪽으로)

    a   b   c
1   4   7  10
2   9  15  21
3  15  24  33

In [73]:
df2.cumsum(axis=1) # 열방향(오른쪽으로)

   a   b   c
1  4  11  21
2  5  13  24
3  6  15  27

###### cumsum을 통해 누적합을 나타낼 수 있다.

In [74]:
df2.cummax()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [76]:
df3 = pd.DataFrame([
    [4, 7, 10], [6, 9, 12], [5, 8, 11]],
    index = [1, 2, 3])
df3

   0  1   2
1  4  7  10
2  6  9  12
3  5  8  11

In [78]:
df3.cummax() ###### 칼럼 기준 최대값을 밑으로 출력

   0  1   2
1  4  7  10
2  6  9  12
3  6  9  12

In [79]:
df2.cummin() # 최솟값 출력

   a  b   c
1  4  7  10
2  4  7  10
3  4  7  10

In [81]:
df2.cumprod() # 곱하기

     a    b     c
1    4    7    10
2   20   56   110
3  120  504  1320